---
kind: property
id: P:Autodesk.Revit.DB.WorksetPreview.UniqueId
source: html/cb675b18-6617-7604-40c9-431a7563d484.htm
---
# Autodesk.Revit.DB.WorksetPreview.UniqueId Property

UniqueId of the workset.

## Syntax (C#)
```csharp
public Guid UniqueId { get; }
```

## Remarks
Stable identifier for a workset, UniqueId will not change while synchronizing with central.